

rem ใช้สำหรับหยุด การรันคำสั่งและให้ค้างหน้าต่างbatchเอาไว้ ไม่ให้ปิดตัวลงหลังจากรันจบ
@pause 


rem cls เคลียร์ข้อความหรือผลลัพธ์ก่อน หน้าcmd และ batch
cls


rem color F9 จะได้ พื้นหลังสีขาว ตัวหนังสือสีฟ้า  ความหมาย ตัวแรกคือสีพื้นหลัง |  ตัวที่สองคือสีตัวหนังสือ 
color F9

rem เลขที่แทนค่าสีต่างๆ 
	0 = Black       8 = Gray
    1 = Blue        9 = Light Blue
    2 = Green       A = Light Green
    3 = Aqua        B = Light Aqua
    4 = Red         C = Light Red
    5 = Purple      D = Light Purple
    6 = Yellow      E = Light Yellow
    7 = White       F = Bright White


--------------------------------------------------------ตัวอย่างตัวแปรต่างๆ-----------------------------------------


rem set ชื่อตัวแปร=ค่าของตัวแปรที่จะใช้ 
set name=LnwZaa   rem ตัวแปรแบบคงที่Fix

rem set ชื่อตัวแปร=ข้อความที่จะโชว์เพื่อให้ป้อนข้อมูล:
set /p name=Input Name:  rem ตัวแปรแบบดิ้นได้ (ต้องมีการป้อนข้อมูลเข้ามา)

set num[0]=1




rem -------------- set /a ตัวแปรแบบ เอาไปคำนวนได้-------------------------

rem set /a ชื่อตัวแปร=1+1
set /a sum=1+1
rem echo %sum% = ได้ค่าเท่ากับ 2 

rem set /a ชื่อตัวแปล=7คูณ9
SET /A mul=7*9
rem echo %mul% = ได้ค่าเท่ากับ 63

rem set /a ชื่อตัวแปล=9หาร3
SET /A div=9/3
rem echo %div% = ได้ค่าเท่ากับ 3


------------------------------------------------ตัวอย่างตัวแปรต่างๆ-----------------------------------------------






---------------------------ตัวอย่างการเรียกใช้ตัวแปรใน-คำสั่ง-batch-เบื้องต้น-------------------------------


rem ----------------ตัวอย่างการใช้ echo และการเรียกใช้ตัวแปรในecho----------------
rem โชว์ข้อความ Hello world ออกมา
echo Hello World
SET name=John
rem โชว์ข้อความจาก %ตัวแปร% การเรียกใช้จากตัวแปรจำเป็นต้องมี % ครอบตัวแปร%
echo %name%
rem output = John 



rem ----------------ตัวอย่างการใช้ echo และการเรียกใช้ตัวแปรในecho----------------




---------------------------ตัวอย่างการเรียกใช้ตัวแปรใน-คำสั่ง-batchเบื้องต้น-------------------------------


rem set /p สำหรับป้อนค่า ตัวแปรเข้ามาใช้งานในตัวอย่างคือรับเลขIPที่ต้องการจะปิงมาใช้
set /p IP=Input IP:

rem คำสั่งping เว้นวรรค %ชื่อตัวแปร%
ping -t %IP%

            --------------------------
			
			

rem ----------------การทำ input เลขให้เลือก หัวข้อที่จะทำ -------------------------------------

set /p number=Input number:
(
IF /I '%number%'=='1' GOTO Backup
IF /I '%number%'=='2' GOTO Restore
)

rem ----------------การทำ input เลขให้เลือก หัวข้อที่จะทำ -------------------------------------



rem ----------------ตัวอย่างคำสั่ง GOTO ใช้สำหรับให้ batch ข้ามไปทำงานบรรทัดอื่น โดยไม่ทำตามลำดับบรรทัด ---------------------
** โดยปกติ batch จะทำงานไล่ทีละบรรทัด จะไม่มีการข้ามไปมาถ้าไม่มีการสั่งด้วย goto
rem ข้าม ทุกบรรทัดไปและไปหาบรรทัดที่ระบุชื่อ ในตัวอย่างนี้คือข้าม ไปหาบรรทัดBackup
goto Backup
↓ข้ามบรรทัด
↓ข้ามบรรทัด
↓ข้ามบรรทัด
↓ข้ามบรรทัด
rem : colonตามด้วยชื่อฟังชั่นใช้สำหรับกระโดดมาหา 
:Backup
echo BlahhhhhhBlahhhhhh   rem หลังจากgoto มาหา backup ก็จะทำตั้งแต่บรรทัด echo BlahhhhhhBlahhhhhh เป็นต้นไป




rem ----------------ตัวอย่างคำสั่ง GOTO ใช้สำหรับให้ batch ข้ามไปทำงานบรรทัดอื่น โดยไม่ทำตามลำดับบรรทัด ---------------------







rem ----------------------------ตัวอย่างการใช้ echoต่างๆ-------------------------

rem โชว์ Userปัจจุปันออกมา 
echo %username% 

rem โชว์ชื่อคอมพิวเตอร์ปัจจุบันออกมา สามารถใช้คำสั่ง hostnameได้เช่นกัน  โดยที่ไม่ต้อง echo นำหน้าคำว่่าhostname
echo %computername%

rem คำสั่งโชว์วันที่  ถ้าเรียกใช้จะได้แบบนี้ตัวอย่าง    Mon 10/31/2022
echo %date% 

rem ----------------------------ตัวอย่างการใช้ echoต่างๆ-------------------------




rem ---------------------------ตัวอย่าง การใช้ loop for ในbatch--------------------------------

*** loop for ใช้กรณีที่เราต้องทำงานแบบวนซ้ำ
------------------ตัวอย่าง-ใช้loop-for-----------------------

rem for /f "tokens=จำนวนรอบ " %%ตัวแแปร (สิ่งที่จะวนแล้วเอาค่ามาเก็บไว้ในตัวแปร หรือจะเป็นที่อยู่ไฟล์ที่ต้องการอ่าน) do (

ภายใต้วงเล็บคือสิ่งที่ต้องการทำการวนซ้ำดูได้ดังตัวอย่างด้านล่าง

rem )

rem ภายในไฟล์computername.txt จะมีชื่อคอมพิมเตอร์อยู่คือ dmit18102,dmit18104
--------------------------↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓-------------------------------
for /F "tokens=*" %%A in (C:\computername.txt) do (


ping %%A


)

↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓
rem ผลลัพธ์ที่ได้จาก forloopนี้คือ จะได้การping ชื่อคอมพิวเตอร์ทั้งหมดในไฟล์ออกมา
Pinging dmit18102.ap.mds.honda.com [10.248.51.53] with 32 bytes of data:
Reply from 10.248.51.53: bytes=32 time=4ms TTL=128
Reply from 10.248.51.53: bytes=32 time=3ms TTL=128
Reply from 10.248.51.53: bytes=32 time=4ms TTL=128
Reply from 10.248.51.53: bytes=32 time=2ms TTL=128

-------------------------------------------------------------------------


Pinging dmit18104.ap.mds.honda.com [10.119.85.176] with 32 bytes of data:
Reply from 10.119.85.176: bytes=32 time=9ms TTL=124
Reply from 10.119.85.176: bytes=32 time=8ms TTL=124
Reply from 10.119.85.176: bytes=32 time=9ms TTL=124
Reply from 10.119.85.176: bytes=32 time=8ms TTL=124

rem ---------------------------ตัวอย่าง การใช้ loop for ในbatch--------------------------------





*****************************เพิ่มเติมเรื่องการ Export log ออกไปเป็นไฟล์ .txtหรือ .csv************************

> export เซฟทับไฟล์เดิม
>> export เขียนเนื้อหาต่อท้ายด้านในไฟล์เดิม

rem การexport ถ้าไม่ระบบปลายทางของไฟล์ที่จะเซฟมันจะเซฟลงตรงจุดที่รันbat ดังตัวอย่างข้างล่าง
hostname > 123.txt


rem คำสั่งดูชื่อเครื่อง > export ที่อยู่ไฟล์ปลายทางที่ออกเป็นไฟล์text
hostname > c:\comname.txt

rem คำสั่งget ซีเรียวนัมเบอร์เครื่อง > export ที่อยู่ไฟล์ปลายทางที่ออกเป็นไฟล์text
wmic bios set serialnumber > c:\serialnumber.txt

rem สามารถรวมทั้งสองคำสั่งแล้วexport ออกมาในไฟล์เดียวกันได้ ด้านในก็จะได้ทั้งชื่อเครื่องและ serialอยู่ในไฟล์เดียวกัน 
hostname > c:\comname-Serial.txt
wmic bios get serialnumber >> c:\comname-Serial.txt.txt









